You are provided with a dictionary containing employees and their monthly sales figures (in thousands of shillings).

SUBMISSION 

Submission of your work: you are required to upload the Notebook

TASKS 

Write a Python program to display each employee’s name and their sales value using a loop. (5 Marks)

Add code to compute and print the total and average sales for all employees. (5 Marks)

 Identify and print the names of employees who met the target (sales ≥ 80) and those who did not meet the target (sales < 80). Use an if-else structure. (5 Marks)

Determine and print the employee(s) with the highest and lowest sales figures. (5 Marks) 

Answer text Question 2

In [1]:
sales = {

    'John': 120,

    'Mary': 95,

    'Peter': 75,

    'Lucy': 130,

    'Brian': 60,

    'Anne': 45,

    'James': 150,

    'Rita': 80

}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(sales, index=[1]).T
df_ok=df.reset_index().rename(columns={'index':'employee', 1:'sales'})
df_ok

  employee  sales
0     John    120
1     Mary     95
2    Peter     75
3     Lucy    130
4    Brian     60
5     Anne     45
6    James    150
7     Rita     80

In [4]:
## Add code to compute and print the total and average sales for all employees. (5 Marks)

In [5]:
df_ok['sales'].mean()

94.375

In [6]:
 ## Identify and print the names of employees who met the target (sales ≥ 80) and those who did not meet the target (sales < 80). Use an if-else structure. (5 Marks)

In [20]:
for i in df_ok['sales']:
    if i>=80:
        print(df_ok['employee'])

0     John
1     Mary
2    Peter
3     Lucy
4    Brian
5     Anne
6    James
7     Rita
Name: employee, dtype: object
0     John
1     Mary
2    Peter
3     Lucy
4    Brian
5     Anne
6    James
7     Rita
Name: employee, dtype: object
0     John
1     Mary
2    Peter
3     Lucy
4    Brian
5     Anne
6    James
7     Rita
Name: employee, dtype: object
0     John
1     Mary
2    Peter
3     Lucy
4    Brian
5     Anne
6    James
7     Rita
Name: employee, dtype: object
0     John
1     Mary
2    Peter
3     Lucy
4    Brian
5     Anne
6    James
7     Rita
Name: employee, dtype: object

In [30]:
if sales.values()<80:
    print(sales.keys())

TypeError: '<' not supported between instances of 'dict_values' and 'int'

In [29]:
sales.keys()

dict_keys(['John', 'Mary', 'Peter', 'Lucy', 'Brian', 'Anne', 'James', 'Rita'])

In [ ]:
### Determine and print the employee(s) with the highest and lowest sales figures. (5 Marks)

In [31]:
#highest sales
df_ok[['employee', 'sales']].sort_values(by ='sales', ascending=False).reset_index()['employee'][0]

'James'

In [32]:
# lowest sales
df_ok[['employee', 'sales']].sort_values(by ='sales').reset_index()['employee'][0]

'Anne'